//Задача №3
//
// ДЗ №22 Климов (Сдвиг многомер массив)
//
////Задание 3. Создайте двухмерный массив. Заполните его
//случайными числами и покажите на экран.Пользователь
//выбирает количество сдвигов и положение(влево, впра -
//	во, вверх, вниз).Выполнить сдвиг массива и показать на
//	экран полученный результат.Сдвиг циклический.
//	Например, если мы имеем следующий массив
//	1 2 0 4 5 3
//	4 5 3 9 0 1
//	и пользователь выбрал сдвиг на 2 разряда вправо, то мы
//	получим
//	5 3 1 2 0 4
//	0 1 4 5 3 9.



#include <iostream>
#include <time.h>

using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	srand(time(NULL));


	cout << "\n ***********************************************************************" << endl;
	cout << " * Программа двухмерного массива со сдвигом элементов в нужную сторону *" << endl;
	cout << " ***********************************************************************" << endl;

	int a = 0;//изменяемый размер массива
	int b = 0;//величина сдвига
	int direction = 0;
	const int N = 10;//ограничение размера массива
	int arr[N][N];

	cout << "Введите размер массива не больше 10: " << "\n";
	cin >> a;
	cout << "Массив с рандомными значениями: " << "\n\n";



	for (int i = 0; i < a; i++)
	{
		for (int j = 0; j < a; j++)
		{
			arr[i][j] = 0 + rand() % (10 - 0);
			cout << arr[i][j] << " ";
		}

		cout << "\n";
	}
	cout << "\n";

	cout << "Укажите кол-во сдвигов элементов" << "\n";
	cin >> b;
	cout << "\n";

	cout << "Укажите направление сдвига элементов" << "\n";
	cout << "1 - вправо" << "\n";
	cout << "2 - влево " << "\n";
	cout << "3 - вниз" << "\n";
	cout << "4 - вверх" << "\n";
	cin >> direction;
	cout << "\n";

	cout << "Массив с учетом введенных параметров: " << "\n\n";

	//==================================================================================================================		

	if (direction == 1)
	{

		for (int k = 0; k < a; k++)//цикл для строк
		{

			for (int h = 0; h < b; h++)//цикл для кол-ва сдвига вправо, т.к. внутренний
				//цикл сдвигает на 1 значение и всегда заполняется только вправо
			{
				int tmp;//временная переменная, временное хранилище, 
				//чтобы сохранить последний элемент
				tmp = arr[k][a - 1];//запись последнего элемента в хранилище

				for (int l = a - 1 - 1; l >= 0; l--)
				{
					arr[k][l + 1] = arr[k][l];
				}
				arr[k][0] = tmp;

			}
		}

		//вывод массива на экран
		for (int i = 0; i < a; i++)
		{
			for (int j = 0; j < a; j++)
			{
				cout << arr[i][j] << " ";
			}

			cout << "\n";
		}
	}

	//==================================================================================================================		


	else if (direction == 2)
	{
		for (int k = 0; k < a; k++)//цикл для строк
		{

			for (int h = 0; h < a - b; h++)//цикл для кол-ва сдвига влево, т.к. внутренний
				//цикл сдвигает на 1 значение и всегда заполняется только вправо
				//чтобы сдвинут влево, нужно на самом деле сдвинуть вправо на величину a-b
			{
				int tmp;//временная переменная, временное хранилище, 
				//чтобы сохранить последний элемент
				tmp = arr[k][a - 1];//запись последнего элемента в хранилище

				for (int l = a - 2; l >= 0; l--)
				{
					arr[k][l + 1] = arr[k][l];
				}
				arr[k][0] = tmp;

			}
		}

		//вывод массива на экран
		for (int i = 0; i < a; i++)
		{
			for (int j = 0; j < a; j++)
			{
				cout << arr[i][j] << " ";
			}

			cout << "\n";
		}
	}
	//==================================================================================================================		

	else if (direction == 3)
	{

		for (int h = 0; h < b; h++)
		{
			for (int k = a - 1; k > 0; k--)//цикл для строк
			{
				for (int l = 0; l < a; l++)
				{
					int tmp;
					tmp = arr[k][l];
					arr[k][l] = arr[k - 1][l];
					arr[k - 1][l] = tmp;
				}

			}
		}


		//вывод массива на экран
		for (int i = 0; i < a; i++)
		{
			for (int j = 0; j < a; j++)
			{
				cout << arr[i][j] << " ";
			}

			cout << "\n";
		}
	}




	//==================================================================================================================		


	else if (direction == 4)
	{

		for (int h = 0; h < a - b; h++)//цикл для строк сдвиг на число указанное пользователем
		{
			for (int k = a - 1; k > 0; k--)//цикл для строк сдвиг на 1
			{
				for (int l = 0; l < a; l++)
				{
					int tmp;
					tmp = arr[k][l];
					arr[k][l] = arr[k - 1][l];
					arr[k - 1][l] = tmp;
				}

			}
		}


		//вывод массива на экран
		for (int i = 0; i < a; i++)
		{
			for (int j = 0; j < a; j++)
			{
				cout << arr[i][j] << " ";
			}

			cout << "\n";
		}

	}

		system("pause");

		return 0;
	
}