// ДЗ #2 Климов (стих #1).cpp 
//Вывести на экран один куплет любимого стихотворения 
//или песни, с указанием автора или исполнителя.Используйте
//escape - последовательности для форматирования.

//директива подключения библиотек
#include <iostream> /

// определение пространства имен для функции, 
//данная запись дает возможность не использовать перед каждой функцией
//пространство имен и оператор для доступа к функциям в стандартном пространстве "::".
using namespace std;  


int main() // главная функция
{
    setlocale(LC_ALL, "Rus"); // настраиваем локальные, российские, параметры в программе
        
    //вывод информации об авторе стихотворения на экран и форматирование текста с помощью Escape-последовательностями
    // \t(отступ), \n(переход на новую строку).
    cout << "\t\tАвтор: Владимир Орлов\n\n";  

    //вывод информации об авторе стихотворения на экран и форматирование текста с помощью Escape-последовательностями
    //\n (переход на новую строку).
    cout << "Стихотворение: Я узнал, что у меня есть огромная семья.\n\n";
    
    //вывод информации об авторе стихотворения на экран и форматирование текста с помощью Escape-последовательностью R"()",
    //что дает возможность не применять к каждой строке Escape-последовательности
    cout << R"(     Я узнал, что у меня
     Есть огромная семья, 
     И тропинка, и лесок ,
     В поле каждый колосок, 
     Речка, небо голубое — 
     Это все мое родное, 
     Это Родина моя, 
     Всех люблю на свете я!)" << endl;// endl - аналог Escape последовательности \n (переход на новую строку)
    
    //данная строка необходима для остановки приложения *.exe, чтобы окно не закрывалось после выполнения программы
    system("PAUSE");

    //при программировании в Linux данная запись для возврата функцией "0" обязательна
    // что означает, что "Всё хорошо!" и возвращает  "0", в противном случае будет ошибка
    // в Win такая запись необязательна
    return 0;

}

