// Задание #1
// 
// ДЗ №33 Климов (массивы и указатели 3)
//
//Используя два указателя на массив целых 
//чисел, скопировать один массив в другой.Использовать
//в программе арифметику указателей для продвижения
//по массиву, а также оператор разыменования.

#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "Rus");
    srand(time(NULL));

    cout << "\n **********************************************************************" << endl;
    cout << " *           Программа действий с массивами через указатели V3.0      *" << endl;
    cout << " **********************************************************************" << endl;

    const int size = 10;
    int arr1[size] = { 1, 3, 5, 7, 9, 11, 13, 15, 17, 19 };
    int arr2[size];
    int* ptrArr1 = arr1;
    int* ptrArr2 = arr2;

    cout << "Первый массив: " << "\n";
    for (int i = 0; i < size; i++)
    {
        cout << arr1[i] << " ";
    }
    cout << "\n\n";

    cout << "Второй массив: " << "\n";
    for (int i = 0; i < size; i++)
    {
        ptrArr2 = ptrArr1;
        cout << *ptrArr2 << " ";
        ptrArr1++;
        ptrArr2++;
    }
    cout << "\n\n";

    system("PAUSE");

    return 0;
}